using IPIL8

# --------------------------------------------------------------------------------------------------
@testset "Тесты на регрессию прямой задачи                  " begin

    # Получим стандартные аргументы
    eval(IPIL8.default_parameters());

    # Загрузим зафиксированные данные регрессионных тестов
    include("direct_regression_tests_data.jl");

    # Тестируем внутреннюю функцию, поэтому входные и выходные векторы размерности N-2;
    y = u₀[2:end-1];
    RP = zero(y);

# --------------------------------------------------------------------------------------------------
@testset "Вектор правой части                               " begin


    IPIL8.directRP!(RP, y, 1, h, N, ε, ulₘ, urₘ);

    @test(isapprox(known_RP, RP));

end # testset Вектор правой части
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
@testset "Три диагонали якобиана правой части                   " begin

    dl = zeros(N-2);
    dd = zeros(N-1);
    du = zeros(N-2);

    IPIL8.DRP!(dl, dd, du, y, 1, h, N, ε, ulₘ, urₘ)

    @test(isapprox(known_dl, dl));
    @test(isapprox(known_dd, dd));
    @test(isapprox(known_du, du));

end
# --------------------------------------------------------------------------------------------------

# --------------------------------------------------------------------------------------------------
@testset "Решение прямой задачи                                 " begin

    solution = zeros(N+1, M+1);

    IPIL8.solve!(solution, u₀, N, h, Tₘ, M, τ, ε, ulₘ, urₘ);

    @test(isapprox(known_u, solution));

end
# --------------------------------------------------------------------------------------------------

end # testset Регрессия прямой задачи
# --------------------------------------------------------------------------------------------------
